const m_ТЕСТ = function () {
  const m_Ф1 = () => (2);
  const m_Ф2 = (m_ИКС) => (m_ИКС);
  const m_УДВ = (m_ИКС) => (m_СЛОЖ(m_ИКС,m_ИКС));
  const m_Ф3 = () => (m_УДВ);
  const m_Ф4 = (m_ИКС,m_Ф) => (m_Ф(m_ИКС));
  const m_Ф5 = () => (m_СПИСОК(1,m_Ф2(m_Ф1())));
  const m_Ф6 = (m_ИКС) => (m_СПИСОК(m_ИКС,m_Ф4(m_Ф1(),m_УДВ),5,m_Ф3()(m_ИКС)));
  const m_Ф7 = () => (m_Ф6(3));
  const m_Ф8 = () => (m_СПИСОК(m_Ф5(),m_Ф7()));
  const m_Ф9 = () => (m_СПИСОК(m_Ф8(),7));
  const m_ФС1 = () => (m_ТЕКСТ("Привет Мир! "));
  const m_ФС2 = () => (m_ТЕКСТ("Привет "));
  const m_ФС3 = (m_ИМЯ) => (m_ИМЯ);
  const m_ФС4 = (m_ИМЯ) => (m_СПИСОК(m_ФС1(),m_ФС2(),m_ФС3(m_ИМЯ)));
  const m_Ф = (m_ИМЯ) => (m_ВЫВОДС(m_ФС4(m_ИМЯ)),m_ВЫВОД(m_Ф9()),0);
  return m_Ф;
}();
